FI/Kertomustiedot/Integraatiopalvelu_Kertomustiedot_Esimerkkisanoma_GetEPRData_Birthsummary_Request_2.0.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:Tieto.HCW.EIS.EPRDocumentService.WCFService" xmlns:tiet="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon" xmlns:tiet1="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.EPRDocumentService.DataContracts">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:GetMaternalCareData_Request>
         <!--Optional:-->
         <urn:MessageHeader>
            <!--Optional:-->
            <!--type: string-->
            <tiet:MessageID>gero et</tiet:MessageID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:TransactionID>sonoras imperio</tiet:TransactionID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:SenderID>quae divum incedo</tiet:SenderID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:SenderApplication>verrantque per auras</tiet:SenderApplication>
            <!--type: string-->
            <tiet:ReceiverID>per auras</tiet:ReceiverID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:ReceiverApplication>circum claustra</tiet:ReceiverApplication>
            <!--Optional:-->
            <!--type: string-->
            <tiet:CharacterSet>nimborum in</tiet:CharacterSet>
            <!--Optional:-->
            <!--type: string-->
            <tiet:DataServiceURL>foedere certo</tiet:DataServiceURL>
            <!--Optional:-->
            <!--type: string-->
            <tiet:UserLanguageCode>profundum quippe ferant</tiet:UserLanguageCode>
            <!--Optional:-->
            <!--type: string-->
            <tiet:VersionNumber>et carcere</tiet:VersionNumber>
         </urn:MessageHeader>
         <!--Optional:-->
         <urn:Common>
            <!--Optional:-->
            <!--type: string-->
            <tiet:ContractKey>yyy</tiet:ContractKey>
            <!--Optional:-->
            <!--type: string-->
            <tiet:UserId>speluncis abdidit</tiet:UserId>
            <!--Optional:-->
            <!--type: string-->
            <tiet:CallingSystem>xxx</tiet:CallingSystem>
            <!--Optional:-->
            <!--type: string-->
            <tiet:CallingUserId>flammas turbine</tiet:CallingUserId>
         </urn:Common>
         <!--Optional:-->
         <urn:PatientId>
            <!--type: string-->
            <tiet1:Identifier>100390-634J</tiet1:Identifier>
         </urn:PatientId>
         <!--Optional:-->
         <urn:MaternalRequestData>
            <!--Optional:-->
            <!--type: string-->
            <tiet1:ClinicID>ac vinclis</tiet1:ClinicID>
            <!--Optional:-->
            <!--type: string-->
            <tiet1:Function>speluncis abdidit</tiet1:Function>
            <!--type: string-->
            <tiet1:LocalOrganizationID>317</tiet1:LocalOrganizationID>
            <!--Optional:-->
            <!--type: string-->
            <tiet1:UserGroup>praeterea aut</tiet1:UserGroup>
            <!--Optional:-->
            <!--type: string-->
            <tiet1:UserID>tieto</tiet1:UserID>
            <!--type: string-->
            <tiet1:Form>SYNNY</tiet1:Form>
         </urn:MaternalRequestData>
      </urn:GetMaternalCareData_Request>
   </soapenv:Body>
</soapenv:Envelope>